# Dockerfile 
# Модель: Туризм: Розподіл завантаження номерів у готелі (на прикладі Marriott, Hyatt)
# Автор: Антонов В. В., група АІ-235

FROM python:3.10-slim

WORKDIR /app

# Копіюємо файл нашої математичної моделі в робочу директорію контейнера
COPY main.py .

# Встановлюємо обов'язкову залежність для розрахунків (NumPy)
RUN pip install --no-cache-dir numpy

# Інформуємо Docker, що сервіс слухає порт 5000
EXPOSE 5000

# Команда для запуску нашої моделі при старті контейнера
CMD ["python", "main.py"]